Catalogs/ДействияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДействияСотрудников</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПроверка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КомпетенцииПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КомпетенцииПерсонала</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеКомпетенции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПроверка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыХарактеристикПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ГруппыХарактеристикПерсонала</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПроверка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ChartsOfCharacteristicTypes/ХарактеристикиПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ХарактеристикиПерсонала</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ЗначенияХарактеристикПерсонала</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>10</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>10</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидХарактеристики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыХарактеристикПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Comment>Помещено в архив</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОценку360</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭлектронноеИнтервью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭлектронноеТестирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭкспертнуюОценку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииХарактеристикПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШкалаЗначений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШкалыЗначенийХарактеристикПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыбораОтветаВОпросахПоКомпетенциям</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыбораОтветовВОпросахПоКомпетенциям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВМатрицеТалантов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

CommonForms/ПодборХарактеристикПерсонала/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьНастройкиФормы();
	НастроитьВидСпискаХарактеристик();
	
	УстановитьПараметрыСпискаХарактеристик();
	УстановитьПараметрыСпискаЗначенийХарактеристик();
			
	УстановитьУсловноеОформлениеДляХарактеристик();	
	
	УстановитьПризнакиОтображенияРеквизитовФормы();
	УстановитьСвойстваЭлементовФормы();
	
	Если Параметры.Свойство("ИспользоватьЭкспертнуюОценку") Тогда
		ИспользоватьЭкспертнуюОценку = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокХарактеристик,
			"Характеристика.ИспользоватьЭкспертнуюОценку",
			Истина,
			ВидСравненияКомпоновкиДанных.Равно,
			"Характеристика",
			Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы И ПодобранныеХарактеристики.Количество() > 0 Тогда
		Отказ = Истина;
		ЗадатьВопросОВыбореОтобранныхХарактеристик();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	СохранитьНастройкиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппыХарактеристикПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ФильтрыПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпетенцииПерсоналаПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ФильтрыПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСотрудниковПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ФильтрыПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофилиДолжностейПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ФильтрыПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрыПриАктивизацииСтрокиОбработчикОжидания()
	
	УстановитьПараметрыДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокХарактеристикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыделенныеСтроки = Элементы.СписокХарактеристик.ВыделенныеСтроки;
	МассивХарактеристик = Новый Массив;
	Для Каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		ТекущиеДанные = Элементы.СписокХарактеристик.ДанныеСтроки(ТекущаяСтрока);
		МассивХарактеристик.Добавить(ТекущиеДанные.Характеристика);
	КонецЦикла;
	Для Каждого ТекущаяХарактеристика Из МассивХарактеристик Цикл
		ДобавитьХарактеристику(ТекущаяХарактеристика);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияХарактеристикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыделенныеСтроки = Элементы.ЗначенияХарактеристик.ВыделенныеСтроки;
	МассивСтрок = Новый Массив;
	Для Каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		ТекущиеДанные = Элементы.ЗначенияХарактеристик.ДанныеСтроки(ТекущаяСтрока);
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Характеристика", ТекущиеДанные.Характеристика);
		СтруктураСтроки.Вставить("Значение", ТекущиеДанные.Значение);
		МассивСтрок.Добавить(СтруктураСтроки);
	КонецЦикла;
	Для Каждого ТекущаяСтрока Из МассивСтрок Цикл
		ДобавитьЗначениеХарактеристики(ТекущаяСтрока.Характеристика, ТекущаяСтрока.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокХарактеристикПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтборЗначенийХарактеристикОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобранныеХарактеристикиПриИзменении(Элемент)
	
	УстановитьПараметрыВыбораСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобранныеХарактеристикиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПодобранныеХарактеристики.ТекущиеДанные;
	Если (ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Характеристика)) Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗначений = Новый Массив;
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Характеристика", ТекущиеДанные.Характеристика);
	СтрокиЗначений = ПодобранныеЗначения.НайтиСтроки(СтруктураПоиска);
	Для Каждого ТекущаяСтрока Из СтрокиЗначений Цикл
		СтруктураЗначения = Новый Структура;
		СтруктураЗначения.Вставить("Значение", ТекущаяСтрока.Значение);
		СтруктураЗначения.Вставить("ВесЗначения", ТекущаяСтрока.ВесЗначения);
		МассивЗначений.Добавить(СтруктураЗначения);
	КонецЦикла;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Характеристика", ТекущиеДанные.Характеристика);
	Оповещение = Новый ОписаниеОповещения("ПодобранныеХарактеристикиЗначениеОкончаниеВыбора", ЭтаФорма, СтруктураПараметров);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Характеристика", ТекущиеДанные.Характеристика);
	ПараметрыОткрытия.Вставить("МассивЗначений", МассивЗначений);
	ОткрытьФорму("ОбщаяФорма.НастройкаЗначенийХарактеристик", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобранныеХарактеристикиПередУдалением(Элемент, Отказ)
	
	ВыделенныеСтроки = Элементы.ПодобранныеХарактеристики.ВыделенныеСтроки;
	МассивХарактеристик = Новый Массив;
	Для Каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		ТекущиеДанные = Элементы.ПодобранныеХарактеристики.ДанныеСтроки(ТекущаяСтрока);
		МассивХарактеристик.Добавить(ТекущиеДанные.Характеристика);
	КонецЦикла;
	
	Для Каждого ТекущаяХарактеристика Из МассивХарактеристик Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Характеристика", ТекущаяХарактеристика);
		СтрокиЗначений = ПодобранныеЗначения.НайтиСтроки(СтруктураПоиска);
		Для Каждого ТекущаяСтрока Из СтрокиЗначений Цикл
			ПодобранныеЗначения.Удалить(ТекущаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьПодбор(Команда)
	ВыполнитьВыборОтобранных();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьХарактеристику(Команда)
	
	ВыделенныеСтроки = Элементы.СписокХарактеристик.ВыделенныеСтроки;
	МассивХарактеристик = Новый Массив;
	Для Каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		ТекущиеДанные = Элементы.СписокХарактеристик.ДанныеСтроки(ТекущаяСтрока);
		МассивХарактеристик.Добавить(ТекущиеДанные.Характеристика);
	КонецЦикла;
	Для Каждого ТекущаяХарактеристика Из МассивХарактеристик Цикл
		ДобавитьХарактеристику(ТекущаяХарактеристика);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеХарактеристики(Команда)
	
	ПараметрДействиеСотрудника = Неопределено;
	ПараметрКомпетенцияПерсонала = Неопределено;
	ПараметрГруппаХарактеристикПерсонала = Неопределено;
	ПараметрПрофильДолжности = Неопределено;
	
	Если ВидПоФункциям
		И Элементы.ДействияСотрудников.ТекущиеДанные <> Неопределено Тогда
		ПараметрДействиеСотрудника = Элементы.ДействияСотрудников.ТекущиеДанные.Ссылка;
	ИначеЕсли ВидПоКомпетенциям
		И Элементы.КомпетенцииПерсонала.ТекущиеДанные <> Неопределено Тогда
		ПараметрКомпетенцияПерсонала = Элементы.КомпетенцииПерсонала.ТекущиеДанные.Ссылка;
	ИначеЕсли ВидПоГруппам
		И Элементы.ГруппыХарактеристик.ТекущиеДанные <> Неопределено Тогда
		ПараметрГруппаХарактеристикПерсонала = Элементы.ГруппыХарактеристик.ТекущиеДанные.Ссылка;
	ИначеЕсли ВидПоПрофилям
		И Элементы.ПрофилиДолжностей.ТекущиеДанные <> Неопределено Тогда
		ПараметрПрофильДолжности = Элементы.ПрофилиДолжностей.ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ПараметрДействиеСотрудника", ПараметрДействиеСотрудника);
	СтруктураПараметров.Вставить("ПараметрКомпетенцияПерсонала", ПараметрКомпетенцияПерсонала);
	СтруктураПараметров.Вставить("ПараметрГруппаХарактеристикПерсонала", ПараметрГруппаХарактеристикПерсонала);
	СтруктураПараметров.Вставить("ПараметрПрофильДолжности", ПараметрПрофильДолжности);
	СтруктураПараметров.Вставить("ИспользоватьЭкспертнуюОценку", ИспользоватьЭкспертнуюОценку);

	МассивХарактеристик = ВсеХарактеристики(СтруктураПараметров);
	Для Каждого ВыбраннаяХарактеристика Из МассивХарактеристик Цикл
		ПоместитьХарактеристикуВТаблицуВыбранныхЗначений(ВыбраннаяХарактеристика, ПараметрДействиеСотрудника, ПараметрКомпетенцияПерсонала, ПараметрГруппаХарактеристикПерсонала, ПараметрПрофильДолжности);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначение(Команда)
	
	ВыделенныеСтроки = Элементы.ЗначенияХарактеристик.ВыделенныеСтроки;
	МассивСтрок = Новый Массив;
	Для Каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		ТекущиеДанные = Элементы.ЗначенияХарактеристик.ДанныеСтроки(ТекущаяСтрока);
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Характеристика", ТекущиеДанные.Характеристика);
		СтруктураСтроки.Вставить("Значение", ТекущиеДанные.Значение);
		МассивСтрок.Добавить(СтруктураСтроки);
	КонецЦикла;
	Для Каждого ТекущаяСтрока Из МассивСтрок Цикл
		ДобавитьЗначениеХарактеристики(ТекущаяСтрока.Характеристика, ТекущаяСтрока.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеЗначения(Команда)
	
	ТекущиеДанные = Элементы.СписокХарактеристик.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДобавитьХарактеристику(ТекущиеДанные.Характеристика);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоФункциям(Команда)
	
	ВидПоФункциям = Истина;
	ВидПоКомпетенциям = Ложь;
	ВидПоГруппам = Ложь;
	ВидПоПрофилям = Ложь;
	
	УстановитьВидСпискаХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоКомпетенциям(Команда)
	
	ВидПоФункциям = Ложь;
	ВидПоКомпетенциям = Истина;
	ВидПоГруппам = Ложь;
	ВидПоПрофилям = Ложь;
	
	УстановитьВидСпискаХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоГруппам(Команда)
	
	ВидПоФункциям = Ложь;
	ВидПоКомпетенциям = Ложь;
	ВидПоГруппам = Истина;
	ВидПоПрофилям = Ложь;
	
	УстановитьВидСпискаХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоПрофилям(Команда)
	
	ВидПоФункциям = Ложь;
	ВидПоКомпетенциям = Ложь;
	ВидПоГруппам = Ложь;
	ВидПоПрофилям = Истина;
	
	УстановитьВидСпискаХарактеристик();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПараметрыДинамическихСписков()
	
	ПараметрДействиеСотрудника = Неопределено;
	ПараметрКомпетенцияПерсонала = Неопределено;
	ПараметрГруппаХарактеристикПерсонала =Неопределено;
	ПараметрПрофильДолжности = Неопределено;
	
	Если ВидПоФункциям И Элементы.ДействияСотрудников.ТекущиеДанные <> Неопределено Тогда
		ПараметрДействиеСотрудника = Элементы.ДействияСотрудников.ТекущиеДанные.Ссылка;
	ИначеЕсли ВидПоКомпетенциям И Элементы.КомпетенцииПерсонала.ТекущиеДанные <> Неопределено Тогда
		ПараметрКомпетенцияПерсонала = Элементы.КомпетенцииПерсонала.ТекущиеДанные.Ссылка;
	ИначеЕсли ВидПоГруппам И Элементы.ГруппыХарактеристик.ТекущиеДанные <> Неопределено Тогда
		ПараметрГруппаХарактеристикПерсонала = Элементы.ГруппыХарактеристик.ТекущиеДанные.Ссылка;
	ИначеЕсли ВидПоПрофилям И Элементы.ПрофилиДолжностей.ТекущиеДанные <> Неопределено Тогда
		ПараметрПрофильДолжности = Элементы.ПрофилиДолжностей.ТекущиеДанные.Ссылка;
	КонецЕсли;
		
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("ДействиеСотрудника",           ПараметрДействиеСотрудника);
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("КомпетенцияПерсонала",         ПараметрКомпетенцияПерсонала);
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("ГруппаХарактеристикПерсонала", ПараметрГруппаХарактеристикПерсонала);
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("ПрофильДолжности", ПараметрПрофильДолжности);
	
	ЗначенияХарактеристик.Параметры.УстановитьЗначениеПараметра("ДействиеСотрудника",           ПараметрДействиеСотрудника);
	ЗначенияХарактеристик.Параметры.УстановитьЗначениеПараметра("КомпетенцияПерсонала",         ПараметрКомпетенцияПерсонала);
	ЗначенияХарактеристик.Параметры.УстановитьЗначениеПараметра("ГруппаХарактеристикПерсонала", ПараметрГруппаХарактеристикПерсонала);
	ЗначенияХарактеристик.Параметры.УстановитьЗначениеПараметра("ПрофильДолжности", ПараметрПрофильДолжности);
	
	ТекущиеДанные = Элементы.СписокХарактеристик.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначенияХарактеристик,
				"Характеристика",
				Неопределено,
				ВидСравненияКомпоновкиДанных.Равно,
				"Характеристика",
				Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначенияХарактеристик,
				"Характеристика",
				ТекущиеДанные.Характеристика,
				ВидСравненияКомпоновкиДанных.Равно,
				"Характеристика",
				Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборЗначенийХарактеристикОбработчикОжидания()
	
	ТекущиеДанные = Элементы.СписокХарактеристик.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначенияХарактеристик,
			"Характеристика",
			ТекущиеДанные.Характеристика,
			ВидСравненияКомпоновкиДанных.Равно,
			"Характеристика",
			Истина);
			
	УстановитьПараметрыВыбораСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьХарактеристикуВТаблицуВыбранныхЗначений(Характеристика, ПараметрДействиеСотрудника, ПараметрКомпетенцияПерсонала, ПараметрГруппаХарактеристикПерсонала, ПараметрПрофильДолжности, Значение=Неопределено)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Характеристика", Характеристика);
	СтрокиХарактеристики = ПодобранныеХарактеристики.НайтиСтроки(СтруктураПоиска);
	Если СтрокиХарактеристики.Количество() = 0 Тогда
		ТекущаяСтрока = ПодобранныеХарактеристики.Добавить();
		ТекущаяСтрока.Характеристика = Характеристика;
		ТекущаяСтрока.КартинкаВида = ВидХарактеристики(Характеристика);
	Иначе
		ТекущаяСтрока = СтрокиХарактеристики[0];
	КонецЕсли;
	
	РезультатыЗапроса = ДобавляемыеЗначения(Характеристика, ПараметрДействиеСотрудника, ПараметрКомпетенцияПерсонала, ПараметрГруппаХарактеристикПерсонала, ПараметрПрофильДолжности, Значение);
	
	ТекущаяСтрока.Вес = ТекущаяСтрока.Вес + РезультатыЗапроса.Вес;
	Если ТекущаяСтрока.Вес = 0 Тогда
		ТекущаяСтрока.Вес = 1;
	КонецЕсли;
	ТекущаяСтрока.ТребуетсяПроверка = ТекущаяСтрока.ТребуетсяПроверка Или РезультатыЗапроса.ТребуетсяПроверка;
	ТекущаяСтрока.ТребуетсяОбучение = ТекущаяСтрока.ТребуетсяОбучение Или РезультатыЗапроса.ТребуетсяОбучение;
	
	Если РезультатыЗапроса.МассивЗначений.Количество() > 0 Тогда
		Для Каждого НовоеЗначение Из РезультатыЗапроса.МассивЗначений Цикл
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Характеристика", НовоеЗначение.Характеристика);
			СтруктураПоиска.Вставить("Значение", НовоеЗначение.Значение);
			НайденныеСтроки = ПодобранныеЗначения.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].ВесЗначения = НайденныеСтроки[0].ВесЗначения + НовоеЗначение.ВесЗначения;
			Иначе
				НоваяСтрока = ПодобранныеЗначения.Добавить();
				НоваяСтрока.Характеристика = Характеристика;
				НоваяСтрока.Значение = НовоеЗначение.Значение;
				НоваяСтрока.ВесЗначения = НовоеЗначение.ВесЗначения;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если Значение = Неопределено Тогда
			СтруктураПоиска = Новый Структура(
				"Характеристика,
				|Значение");
			СтруктураПоиска.Характеристика = Характеристика;
			НайденныеСтроки = ПодобранныеЗначения.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].ВесЗначения = НайденныеСтроки[0].ВесЗначения + 1;
			Иначе
				НоваяСтрока = ПодобранныеЗначения.Добавить();
				НоваяСтрока.Характеристика = Характеристика;
				НоваяСтрока.ВесЗначения = 1;
			КонецЕсли;
		Иначе
			НоваяСтрока = ПодобранныеЗначения.Добавить();
			НоваяСтрока.Характеристика = Характеристика;
			НоваяСтрока.Значение = Значение;
			НоваяСтрока.ВесЗначения = 1;
		КонецЕсли;
	КонецЕсли;
	
	ЗначенияСтрокой = "";
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Характеристика", Характеристика);
	СтрокиХарактеристики = ПодобранныеЗначения.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаЗначения Из СтрокиХарактеристики Цикл
		Если ЗначениеЗаполнено(СтрокаЗначения.Значение) Тогда
			ЗначенияСтрокой = СокрЛП(ЗначенияСтрокой) + ?(ЗначенияСтрокой = "", "", ", ") + СокрЛП(Строка(СтрокаЗначения.Значение));
		КонецЕсли;
	КонецЦикла;
	ТекущаяСтрока.ЗначенияСтрокой = ЗначенияСтрокой;
	
	УстановитьПараметрыВыбораСписков();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавляемыеЗначения(Характеристика, ПараметрДействиеСотрудника, ПараметрКомпетенцияПерсонала, ПараметрГруппаХарактеристикПерсонала, ПараметрПрофильДолжности, Значение)
	
	РезультатЗапроса = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДействиеСотрудника", ПараметрДействиеСотрудника);
	Запрос.УстановитьПараметр("КомпетенцияПерсонала", ПараметрКомпетенцияПерсонала);
	Запрос.УстановитьПараметр("ГруппаХарактеристикПерсонала", ПараметрГруппаХарактеристикПерсонала);
	Запрос.УстановитьПараметр("ПрофильДолжности", ПараметрПрофильДолжности);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Значение", Значение);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДействияСотрудников.Характеристика КАК Характеристика,
		|	ДействияСотрудников.Значение КАК Значение,
		|	МАКСИМУМ(ДействияСотрудников.Вес) КАК Вес,
		|	МАКСИМУМ(ДействияСотрудников.ТребуетсяПроверка) КАК ТребуетсяПроверка,
		|	МАКСИМУМ(ДействияСотрудников.ТребуетсяОбучение) КАК ТребуетсяОбучение,
		|	МАКСИМУМ(ДействияСотрудников.ВесЗначения) КАК ВесЗначения
		|ПОМЕСТИТЬ ВТХарактеристики
		|ИЗ
		|	Справочник.ДействияСотрудников.ХарактеристикиПерсонала КАК ДействияСотрудников
		|ГДЕ
		|	&ДействиеСотрудника <> НЕОПРЕДЕЛЕНО
		|	И ДействияСотрудников.Ссылка В ИЕРАРХИИ(&ДействиеСотрудника)
		|	И ДействияСотрудников.Характеристика = &Характеристика
		|	И (ДействияСотрудников.Значение = &Значение
		|			ИЛИ &Значение = НЕОПРЕДЕЛЕНО)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДействияСотрудников.Характеристика,
		|	ДействияСотрудников.Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомпетенцииПерсонала.Характеристика,
		|	КомпетенцииПерсонала.Значение,
		|	МАКСИМУМ(КомпетенцииПерсонала.Вес),
		|	МАКСИМУМ(КомпетенцииПерсонала.ТребуетсяПроверка),
		|	МАКСИМУМ(КомпетенцииПерсонала.ТребуетсяОбучение),
		|	МАКСИМУМ(КомпетенцииПерсонала.ВесЗначения)
		|ИЗ
		|	Справочник.КомпетенцииПерсонала.ХарактеристикиПерсонала КАК КомпетенцииПерсонала
		|ГДЕ
		|	&КомпетенцияПерсонала <> НЕОПРЕДЕЛЕНО
		|	И КомпетенцииПерсонала.Ссылка В ИЕРАРХИИ(&КомпетенцияПерсонала)
		|	И КомпетенцииПерсонала.Характеристика = &Характеристика
		|	И (КомпетенцииПерсонала.Значение = &Значение
		|			ИЛИ &Значение = НЕОПРЕДЕЛЕНО)
		|
		|СГРУППИРОВАТЬ ПО
		|	КомпетенцииПерсонала.Характеристика,
		|	КомпетенцииПерсонала.Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГруппыХарактеристикПерсонала.Характеристика,
		|	ГруппыХарактеристикПерсонала.Значение,
		|	МАКСИМУМ(ГруппыХарактеристикПерсонала.Вес),
		|	МАКСИМУМ(ГруппыХарактеристикПерсонала.ТребуетсяПроверка),
		|	МАКСИМУМ(ГруппыХарактеристикПерсонала.ТребуетсяОбучение),
		|	МАКСИМУМ(ГруппыХарактеристикПерсонала.ВесЗначения)
		|ИЗ
		|	Справочник.ГруппыХарактеристикПерсонала.ХарактеристикиПерсонала КАК ГруппыХарактеристикПерсонала
		|ГДЕ
		|	&ГруппаХарактеристикПерсонала <> НЕОПРЕДЕЛЕНО
		|	И ГруппыХарактеристикПерсонала.Ссылка В ИЕРАРХИИ(&ГруппаХарактеристикПерсонала)
		|	И ГруппыХарактеристикПерсонала.Характеристика = &Характеристика
		|	И (ГруппыХарактеристикПерсонала.Значение = &Значение
		|			ИЛИ &Значение = НЕОПРЕДЕЛЕНО)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГруппыХарактеристикПерсонала.Характеристика,
		|	ГруппыХарактеристикПерсонала.Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрофилиДолжностейХарактеристикиПерсонала.Характеристика,
		|	ПрофилиДолжностейХарактеристикиПерсонала.Значение,
		|	МАКСИМУМ(ПрофилиДолжностейХарактеристикиПерсонала.Вес),
		|	МАКСИМУМ(ПрофилиДолжностейХарактеристикиПерсонала.ТребуетсяПроверка),
		|	МАКСИМУМ(ПрофилиДолжностейХарактеристикиПерсонала.ТребуетсяОбучение),
		|	МАКСИМУМ(ПрофилиДолжностейХарактеристикиПерсонала.ВесЗначения)
		|ИЗ
		|	Справочник.ПрофилиДолжностей.ХарактеристикиПерсонала КАК ПрофилиДолжностейХарактеристикиПерсонала
		|ГДЕ
		|	&ПрофильДолжности <> НЕОПРЕДЕЛЕНО
		|	И ПрофилиДолжностейХарактеристикиПерсонала.Ссылка = &ПрофильДолжности
		|	И ПрофилиДолжностейХарактеристикиПерсонала.Характеристика = &Характеристика
		|	И (ПрофилиДолжностейХарактеристикиПерсонала.Значение = &Значение
		|			ИЛИ &Значение = НЕОПРЕДЕЛЕНО)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрофилиДолжностейХарактеристикиПерсонала.Характеристика,
		|	ПрофилиДолжностейХарактеристикиПерсонала.Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХарактеристикиПерсонала.Ссылка,
		|	ЗначенияХарактеристик.Ссылка,
		|	1,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	1
		|ИЗ
		|	ПланВидовХарактеристик.ХарактеристикиПерсонала КАК ХарактеристикиПерсонала
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗначенияХарактеристик КАК ЗначенияХарактеристик
		|		ПО ХарактеристикиПерсонала.ШкалаЗначений = ЗначенияХарактеристик.Владелец
		|			И (НЕ ЗначенияХарактеристик.ПометкаУдаления)
		|ГДЕ
		|	&ДействиеСотрудника = НЕОПРЕДЕЛЕНО
		|	И &КомпетенцияПерсонала = НЕОПРЕДЕЛЕНО
		|	И &ГруппаХарактеристикПерсонала = НЕОПРЕДЕЛЕНО
		|	И &ПрофильДолжности = НЕОПРЕДЕЛЕНО
		|	И ХарактеристикиПерсонала.Ссылка = &Характеристика
		|	И (ЗначенияХарактеристик.Ссылка = &Значение
		|			ИЛИ &Значение = НЕОПРЕДЕЛЕНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Характеристики.Характеристика КАК Характеристика,
		|	Характеристики.Значение КАК Значение,
		|	СУММА(Характеристики.Вес) КАК Вес,
		|	МАКСИМУМ(Характеристики.ТребуетсяПроверка) КАК ТребуетсяПроверка,
		|	МАКСИМУМ(Характеристики.ТребуетсяОбучение) КАК ТребуетсяОбучение,
		|	СУММА(Характеристики.ВесЗначения) КАК ВесЗначения
		|ИЗ
		|	ВТХарактеристики КАК Характеристики
		|
		|СГРУППИРОВАТЬ ПО
		|	Характеристики.Характеристика,
		|	Характеристики.Значение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Характеристики.Характеристика КАК Характеристика,
		|	МАКСИМУМ(Характеристики.Вес) КАК Вес,
		|	МАКСИМУМ(Характеристики.ТребуетсяПроверка) КАК ТребуетсяПроверка,
		|	МАКСИМУМ(Характеристики.ТребуетсяОбучение) КАК ТребуетсяОбучение
		|ИЗ
		|	ВТХарактеристики КАК Характеристики
		|
		|СГРУППИРОВАТЬ ПО
		|	Характеристики.Характеристика";
		
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[2].Выбрать();
	Если Выборка.Следующий() Тогда
		РезультатЗапроса.Вставить("Вес", Выборка.Вес);
		РезультатЗапроса.Вставить("ТребуетсяПроверка", Выборка.ТребуетсяПроверка);
		РезультатЗапроса.Вставить("ТребуетсяОбучение", Выборка.ТребуетсяОбучение);
	Иначе
		РезультатЗапроса.Вставить("Вес", 0);
		РезультатЗапроса.Вставить("ТребуетсяПроверка", Ложь);
		РезультатЗапроса.Вставить("ТребуетсяОбучение", Ложь);
	КонецЕсли;
	
	МассивЗначений = Новый Массив;
	Если НЕ Результат[1].Пустой() Тогда
		Выборка = Результат[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураЗначения = Новый Структура;
			СтруктураЗначения.Вставить("Характеристика", Выборка.Характеристика);
			СтруктураЗначения.Вставить("Значение", Выборка.Значение);
			СтруктураЗначения.Вставить("ВесЗначения", Выборка.ВесЗначения);
			МассивЗначений.Добавить(СтруктураЗначения);
		КонецЦикла;
	КонецЕсли;
	РезультатЗапроса.Вставить("МассивЗначений", МассивЗначений);
	
	Возврат РезультатЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьНастройкиФормы()
	
	ДанныеНастройки = ХранилищеОбщихНастроек.Загрузить("ПодборХарактеристикПерсонала", "НастройкиФормы",, ИмяПользователя());
	Если ТипЗнч(ДанныеНастройки) = Тип("Структура") Тогда
		ДанныеНастройки.Свойство("ВидПоФункциям", ВидПоФункциям);
		ДанныеНастройки.Свойство("ВидПоКомпетенциям", ВидПоКомпетенциям);
		ДанныеНастройки.Свойство("ВидПоГруппам", ВидПоГруппам);
		ДанныеНастройки.Свойство("ВидПоПрофилям", ВидПоПрофилям);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормы()
	
	ДанныеНастройки = Новый Структура;
	ДанныеНастройки.Вставить("ВидПоФункциям", ВидПоФункциям);
	ДанныеНастройки.Вставить("ВидПоКомпетенциям", ВидПоКомпетенциям);
	ДанныеНастройки.Вставить("ВидПоГруппам", ВидПоГруппам);
	ДанныеНастройки.Вставить("ВидПоПрофилям", ВидПоПрофилям);
	ХранилищеОбщихНастроек.Сохранить("ПодборХарактеристикПерсонала", "НастройкиФормы", ДанныеНастройки,, ИмяПользователя());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВсеХарактеристики(СтруктураПараметров)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДействиеСотрудника", СтруктураПараметров.ПараметрДействиеСотрудника);
	Запрос.УстановитьПараметр("КомпетенцияПерсонала", СтруктураПараметров.ПараметрКомпетенцияПерсонала);
	Запрос.УстановитьПараметр("ГруппаХарактеристикПерсонала", СтруктураПараметров.ПараметрГруппаХарактеристикПерсонала);
	Запрос.УстановитьПараметр("ПрофильДолжности", СтруктураПараметров.ПараметрПрофильДолжности);
	Запрос.УстановитьПараметр("ИспользоватьЭкспертнуюОценку", СтруктураПараметров.ИспользоватьЭкспертнуюОценку);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Характеристика КАК Характеристика
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДействияСотрудников.Характеристика КАК Характеристика,
		|		ДействияСотрудников.Значение КАК Значение
		|	ИЗ
		|		Справочник.ДействияСотрудников.ХарактеристикиПерсонала КАК ДействияСотрудников
		|	ГДЕ
		|		&ДействиеСотрудника <> НЕОПРЕДЕЛЕНО
		|		И ДействияСотрудников.Ссылка В ИЕРАРХИИ(&ДействиеСотрудника)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КомпетенцииПерсонала.Характеристика,
		|		КомпетенцииПерсонала.Значение
		|	ИЗ
		|		Справочник.КомпетенцииПерсонала.ХарактеристикиПерсонала КАК КомпетенцииПерсонала
		|	ГДЕ
		|		&КомпетенцияПерсонала <> НЕОПРЕДЕЛЕНО
		|		И КомпетенцииПерсонала.Ссылка В ИЕРАРХИИ(&КомпетенцияПерсонала)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ГруппыХарактеристикПерсонала.Характеристика,
		|		ГруппыХарактеристикПерсонала.Значение
		|	ИЗ
		|		Справочник.ГруппыХарактеристикПерсонала.ХарактеристикиПерсонала КАК ГруппыХарактеристикПерсонала
		|	ГДЕ
		|		&ГруппаХарактеристикПерсонала <> НЕОПРЕДЕЛЕНО
		|		И ГруппыХарактеристикПерсонала.Ссылка В ИЕРАРХИИ(&ГруппаХарактеристикПерсонала)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПрофилиДолжностейХарактеристикиПерсонала.Характеристика,
		|		ПрофилиДолжностейХарактеристикиПерсонала.Значение
		|	ИЗ
		|		Справочник.ПрофилиДолжностей.ХарактеристикиПерсонала КАК ПрофилиДолжностейХарактеристикиПерсонала
		|	ГДЕ
		|		&ПрофильДолжности <> НЕОПРЕДЕЛЕНО
		|		И ПрофилиДолжностейХарактеристикиПерсонала.Ссылка = &ПрофильДолжности
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ХарактеристикиПерсонала.Ссылка,
		|		ЗначенияХарактеристик.Ссылка
		|	ИЗ
		|		ПланВидовХарактеристик.ХарактеристикиПерсонала КАК ХарактеристикиПерсонала
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗначенияХарактеристик КАК ЗначенияХарактеристик
		|			ПО ХарактеристикиПерсонала.ШкалаЗначений = ЗначенияХарактеристик.Владелец
		|				И (НЕ ЗначенияХарактеристик.ПометкаУдаления)
		|	ГДЕ
		|		&ДействиеСотрудника = НЕОПРЕДЕЛЕНО
		|		И &КомпетенцияПерсонала = НЕОПРЕДЕЛЕНО
		|		И &ГруппаХарактеристикПерсонала = НЕОПРЕДЕЛЕНО
		|		И &ПрофильДолжности = НЕОПРЕДЕЛЕНО) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ИспользоватьЭкспертнуюОценку
		|				ТОГДА ВложенныйЗапрос.Характеристика.ИспользоватьЭкспертнуюОценку = ИСТИНА
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Характеристика";
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивХарактеристик = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивХарактеристик.Добавить(Выборка.Характеристика);
	КонецЦикла;
	
	Возврат МассивХарактеристик;

КонецФункции

&НаКлиенте
Процедура ДобавитьХарактеристику(Характеристика)
	
	ПараметрДействиеСотрудника = Неопределено;
	ПараметрКомпетенцияПерсонала = Неопределено;
	ПараметрГруппаХарактеристикПерсонала = Неопределено;
	ПараметрПрофильДолжности = Неопределено;
	
	Если ВидПоФункциям
		И Элементы.ДействияСотрудников.ТекущиеДанные <> Неопределено Тогда
		ПараметрДействиеСотрудника = Элементы.ДействияСотрудников.ТекущиеДанные.Ссылка;
	ИначеЕсли ВидПоКомпетенциям
		И Элементы.КомпетенцииПерсонала.ТекущиеДанные <> Неопределено Тогда
		ПараметрКомпетенцияПерсонала = Элементы.КомпетенцииПерсонала.ТекущиеДанные.Ссылка;
	ИначеЕсли ВидПоГруппам
		И Элементы.ГруппыХарактеристик.ТекущиеДанные <> Неопределено Тогда
		ПараметрГруппаХарактеристикПерсонала = Элементы.ГруппыХарактеристик.ТекущиеДанные.Ссылка;
	ИначеЕсли ВидПоПрофилям
		И Элементы.ПрофилиДолжностей.ТекущиеДанные <> Неопределено Тогда
		ПараметрПрофильДолжности = Элементы.ПрофилиДолжностей.ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	ПоместитьХарактеристикуВТаблицуВыбранныхЗначений(Характеристика, ПараметрДействиеСотрудника, ПараметрКомпетенцияПерсонала, ПараметрПрофильДолжности, ПараметрГруппаХарактеристикПерсонала);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначениеХарактеристики(Характеристика, ЗначениеХарактеристики)
	
	ПараметрДействиеСотрудника = Неопределено;
	ПараметрКомпетенцияПерсонала = Неопределено;
	ПараметрГруппаХарактеристикПерсонала = Неопределено;
	ПараметрПрофильДолжности = Неопределено;
	
	Если ВидПоФункциям
		И Элементы.ДействияСотрудников.ТекущиеДанные <> Неопределено Тогда
		ПараметрДействиеСотрудника = Элементы.ДействияСотрудников.ТекущиеДанные.Ссылка;
	ИначеЕсли ВидПоКомпетенциям
		И Элементы.КомпетенцииПерсонала.ТекущиеДанные <> Неопределено Тогда
		ПараметрКомпетенцияПерсонала = Элементы.КомпетенцииПерсонала.ТекущиеДанные.Ссылка;
	ИначеЕсли ВидПоГруппам
		И Элементы.ГруппыХарактеристик.ТекущиеДанные <> Неопределено Тогда
		ПараметрГруппаХарактеристикПерсонала = Элементы.ГруппыХарактеристик.ТекущиеДанные.Ссылка;
	ИначеЕсли ВидПоПрофилям
		И Элементы.ПрофилиДолжностей.ТекущиеДанные <> Неопределено Тогда
		ПараметрПрофильДолжности = Элементы.ПрофилиДолжностей.ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	ПоместитьХарактеристикуВТаблицуВыбранныхЗначений(Характеристика, ПараметрДействиеСотрудника, ПараметрКомпетенцияПерсонала, ПараметрГруппаХарактеристикПерсонала, ПараметрПрофильДолжности, ЗначениеХарактеристики);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораСписков()

	СписокВыбранныхХарактеристик = Новый СписокЗначений;
	Для Каждого ВыбранноеЗначение Из ПодобранныеЗначения Цикл
		Если СписокВыбранныхХарактеристик.НайтиПоЗначению(ВыбранноеЗначение.Характеристика) = Неопределено Тогда
			СписокВыбранныхХарактеристик.Добавить(ВыбранноеЗначение.Характеристика);
		КонецЕсли;
	КонецЦикла;
	
	СписокХарактеристик.УсловноеОформление.Элементы[0].Отбор.Элементы[0].ПравоеЗначение = СписокВыбранныхХарактеристик;
	
	ТекущиеДанные = Элементы.СписокХарактеристик.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбранныхЗначений = Новый СписокЗначений;
	Для Каждого ВыбранноеЗначение Из ПодобранныеЗначения Цикл
		Если ВыбранноеЗначение.Характеристика = ТекущиеДанные.Характеристика Тогда
			СписокВыбранныхЗначений.Добавить(ВыбранноеЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЗначенияХарактеристик.УсловноеОформление.Элементы[0].Отбор.Элементы[0].Элементы[0].ПравоеЗначение = ТекущиеДанные.Характеристика;
	ЗначенияХарактеристик.УсловноеОформление.Элементы[0].Отбор.Элементы[0].Элементы[1].ПравоеЗначение = СписокВыбранныхЗначений;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобранныеХарактеристикиХарактеристикаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПодобранныеХарактеристики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.КартинкаВида = ВидХарактеристики(ТекущиеДанные.Характеристика);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидХарактеристики(Характеристика)
	Возврат ХарактеристикиПерсонала.ВидИКартинкаХарактеристики(Характеристика).Картинка;
КонецФункции

// Обработчик оповещения о закрытии формы настройки весов характеристик.
// Добавляет подобранные значения характеристик персонала и их веса.
//
// Параметры 
//	Результат - Структура - структура, содержащая характеристику персонала и массив структур выбранных значений этой характеристики и их весов. 
//	ДополнительныеПараметры - Структура - структура дополнительных параметров.
//
&НаКлиенте
Процедура ПодобранныеХарактеристикиЗначениеОкончаниеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяХарактеристика = Результат.Характеристика;
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Характеристика", ТекущаяХарактеристика);
	СтрокиХарактеристики = ПодобранныеХарактеристики.НайтиСтроки(СтруктураПоиска);
	Если СтрокиХарактеристики.Количество() > 0 Тогда
		СтрокаХарактеристики = СтрокиХарактеристики[0];
	Иначе
		СтрокаХарактеристики = ПодобранныеХарактеристики.Добавить();
		СтрокаХарактеристики.Характеристика = ТекущаяХарактеристика;
		СтрокаХарактеристики.Вес = 1;
		СтрокаХарактеристики.КартинкаВида = ВидХарактеристики(ТекущаяХарактеристика);
	КонецЕсли;
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Характеристика", ТекущаяХарактеристика);
	СтрокиЗначений = ПодобранныеЗначения.НайтиСтроки(СтруктураПоиска);
	Для Каждого ТекущаяСтрока Из СтрокиЗначений Цикл
		ПодобранныеЗначения.Удалить(ТекущаяСтрока);
	КонецЦикла;
	ЗначенияСтрокой = "";
	Для Каждого ТекущаяСтрока Из Результат.МассивЗначений Цикл
		НоваяСтрока = ПодобранныеЗначения.Добавить();
		НоваяСтрока.Характеристика = ТекущаяХарактеристика;
		НоваяСтрока.Значение = ТекущаяСтрока.Значение;
		НоваяСтрока.ВесЗначения = ТекущаяСтрока.ВесЗначения;
		ЗначенияСтрокой = СокрЛП(ЗначенияСтрокой) + ?(ЗначенияСтрокой = "", "", ", ") + СокрЛП(Строка(ТекущаяСтрока.Значение));
	КонецЦикла;
	СтрокаХарактеристики.ЗначенияСтрокой = ЗначенияСтрокой;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаХарактеристик()

	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("ДействиеСотрудника",           Неопределено);
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("КомпетенцияПерсонала",         Неопределено);
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("ГруппаХарактеристикПерсонала", Неопределено);
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("ПрофильДолжности", Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаЗначенийХарактеристик()

	ЗначенияХарактеристик.Параметры.УстановитьЗначениеПараметра("ДействиеСотрудника",           Неопределено);
	ЗначенияХарактеристик.Параметры.УстановитьЗначениеПараметра("КомпетенцияПерсонала",         Неопределено);
	ЗначенияХарактеристик.Параметры.УстановитьЗначениеПараметра("ГруппаХарактеристикПерсонала", Неопределено);
	ЗначенияХарактеристик.Параметры.УстановитьЗначениеПараметра("ПрофильДолжности", Неопределено);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЗначенияХарактеристик,
		"Характеристика",
		Неопределено,
		ВидСравненияКомпоновкиДанных.Равно,
		"Характеристика",
		Истина);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеДляХарактеристик()
	
	ЭлементОформления = ЗначенияХарактеристик.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстПодобранногоЗначенияЦвет);
		
	ГруппаОтбораИ = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Характеристика");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Неопределено;
	
	ОтборЭлемента = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Значение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = Новый СписокЗначений;
	
	ЭлементОформления = СписокХарактеристик.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстПодобранногоЗначенияЦвет);
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Характеристика");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = Новый СписокЗначений;
	ЭлементОформления.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакиОтображенияРеквизитовФормы()

	Если Не Параметры.Свойство("СкрытьРеквизиты") Тогда
		Возврат;
	КонецЕсли;
	
	СписокСкрываемыхРеквизитов = Параметры.СкрытьРеквизиты;
	
	Если СписокСкрываемыхРеквизитов.Свойство("Значения") Тогда
		СкрытьЗначенияХарактеристик = Истина;
		СкрытьВесаЗначений = Истина;
		СкрытьТребуетсяОбучение = Истина;
		СкрытьТребуетсяПроверка = Истина;
		Возврат;
	КонецЕсли;
	
	Если СписокСкрываемыхРеквизитов.Свойство("Вес") Тогда
		СкрытьВесаЗначений = Истина;
	КонецЕсли;
	Если СписокСкрываемыхРеквизитов.Свойство("ТребуетсяОбучение") Тогда
		СкрытьТребуетсяОбучение = Истина;
	КонецЕсли;
	Если СписокСкрываемыхРеквизитов.Свойство("ТребуетсяПроверка") Тогда
		СкрытьТребуетсяПроверка = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаСписокЗначенийХарактеристик",
		"Видимость",
		Не СкрытьЗначенияХарактеристик);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПодобранныеХарактеристикиЗначение",
		"Видимость",
		Не СкрытьЗначенияХарактеристик);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПодобранныеХарактеристикиВес",
		"Видимость",
		Не СкрытьВесаЗначений);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПодобранныеХарактеристикиТребуетсяПроверка",
		"Видимость",
		Не СкрытьТребуетсяПроверка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПодобранныеХарактеристикиТребуетсяОбучение",
		"Видимость",
		Не СкрытьТребуетсяОбучение);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидСпискаХарактеристик()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаПоФункциям", "Пометка", ВидПоФункциям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаПоКомпетенциям", "Пометка", ВидПоКомпетенциям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаПоГруппам", "Пометка", ВидПоГруппам);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаПоПрофилям", "Пометка", ВидПоПрофилям);
	Если ВидПоКомпетенциям Тогда
		Элементы.ВидСписка.Заголовок = НСтр("ru = 'По компетенциям'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыНавигация", "ТекущаяСтраница", Элементы.СтраницаКомпетенцииПерсонала);
	ИначеЕсли ВидПоГруппам Тогда
		Элементы.ВидСписка.Заголовок = НСтр("ru = 'По группам'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыНавигация", "ТекущаяСтраница", Элементы.СтраницаГруппыХарактеристик);
	ИначеЕсли ВидПоФункциям Тогда
		Элементы.ВидСписка.Заголовок = НСтр("ru = 'По функциям'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыНавигация", "ТекущаяСтраница", Элементы.СтраницаДействияСотрудников);
	ИначеЕсли ВидПоПрофилям Тогда
		Элементы.ВидСписка.Заголовок = НСтр("ru = 'По профилям'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыНавигация", "ТекущаяСтраница", Элементы.СтраницаПрофилиДолжностей);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидСпискаХарактеристик()
	
	Если ВидПоФункциям = Неопределено Тогда
		ВидПоФункциям = Истина;
		ВидПоКомпетенциям = Ложь;
		ВидПоГруппам = Ложь;
		ВидПоПрофилям = Ложь;
	КонецЕсли;
	
	УстановитьВидСпискаХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОВыбореОтобранныхХарактеристик()
	
	Оповещение = Новый ОписаниеОповещения("ЗадатьВопросОВыбореОтобранныхХарактеристикЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru='Выполнить выбор отобранных характеристик?'"), РежимДиалогаВопрос.ДаНетОтмена,);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОВыбореОтобранныхХарактеристикЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьВыборОтобранных();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ПодобранныеХарактеристики.Очистить();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыборОтобранных()
	
	МассивСтрок = Новый Массив;
	Для Каждого ТекущаяСтрока Из ПодобранныеХарактеристики Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Характеристика", ТекущаяСтрока.Характеристика);
		СтрокиЗначений = ПодобранныеЗначения.НайтиСтроки(СтруктураПоиска);
		Для Каждого ТекущаяСтрокаЗначений Из СтрокиЗначений Цикл
			СтруктураСтроки = Новый Структура(
				"Характеристика, 
				|Значение,
				|Вес,
				|ТребуетсяПроверка,
				|ТребуетсяОбучение,
				|ВесЗначения");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущаяСтрока);
			СтруктураСтроки.Вставить("Значение", ТекущаяСтрокаЗначений.Значение);
			СтруктураСтроки.Вставить("ВесЗначения", ТекущаяСтрокаЗначений.ВесЗначения);
			МассивСтрок.Добавить(СтруктураСтроки);
		КонецЦикла;
	КонецЦикла;
	
	ПодобранныеХарактеристики.Очистить();
	
	Если Открыта() Тогда
		Закрыть(МассивСтрок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
